#ifndef QUESTION_H_
#define QUESTION_H_

#include <vector>
using namespace std;

// -----ここにヒントを書く-----

// 🕷️ SPIDER の行ヒント
const vector<vector<int>> Hints_Line_SPIDER = {
    {1}, {3}, {1, 1}, {5}, {1}, {1}, {3}, {1, 1}, {5}, {1}};

const vector<vector<int>> Hints_Col_SPIDER = {
    {1}, {2}, {1, 1}, {5}, {1}, {1}, {3}, {1, 1}, {5}, {1}};

// ❤️ HEART の行ヒント（仮の例）
const vector<vector<int>> Hints_Line_HEART = {
    {2}, {4}, {6}, {4}, {2}, {1}, {1}, {1}, {1}, {1}};

const vector<vector<int>> Hints_Col_HEART = {
    {1}, {3}, {5}, {3}, {1}, {1}, {1}, {1}, {1}, {1}};

// SCOPIONのヒント
const vector<vector<int>> Hints_Line_SCOPION = {
    {3}, {4}, {1, 1}, {4, 1}, {2, 1, 1}, {1, 5, 1}, {8}, {6}, {4, 1, 1, 1}, {2, 1, 1}};

const vector<vector<int>> Hints_Col_SCOPION = {
    {3, 1}, {2, 2}, {1, 1, 2}, {6}, {3}, {4}, {3, 3, 1}, {2, 4}, {2, 2, 1}, {6, 1}};

// 20*20 学士論文の問題(難易度”高”)
const vector<vector<int>> Hints_Line_quatro2 = {
    {1, 1}, {8, 3}, {1, 1, 1, 1, 1, 1}, {1, 1, 1, 1, 1, 1}, {1, 3}, {3, 1, 4, 7}, {1, 1, 1, 1, 8}, {1, 1, 1, 1}, {3, 1, 1, 1, 1, 1}, {5, 1, 1, 1, 1, 1}, {2}, {2, 2, 2}, {2, 4, 2}, {6, 1, 2, 2, 1}, {1, 3, 2, 1, 2}, {1, 1, 3, 1, 2, 1}, {1, 1, 2, 2, 2}, {1, 1, 1, 1, 2, 2}, {2, 2, 1, 1, 4}, {3, 1, 1, 1, 2}};

const vector<vector<int>> Hints_Col_quatro2 = {
    {2, 1, 4}, {1, 2, 2}, {3, 1, 1, 1, 1}, {1, 1, 1, 1, 2}, {1, 2, 1, 2}, {10, 1}, {1, 4, 7}, {3, 1, 3, 4}, {1, 2, 3, 3}, {2, 1}, {1, 6, 2}, {5, 2, 3}, {1, 6, 1, 2, 2, 1}, {2, 2, 2}, {2, 1, 1, 1}, {2, 2, 1, 2, 1}, {2, 2, 3}, {2, 2, 1, 2, 2, 1}, {2, 2, 3}, {4, 2}};

// 20*20 学士論文の問題(難易度”中")
const vector<vector<int>> Hints_Line_quatro1 = {
    {1, 1, 2, 2}, {1, 2, 1, 2, 2}, {1, 2, 1, 6}, {2, 1, 2, 8}, {6, 3, 3}, {4, 4, 4}, {4, 4, 4}, {8, 4, 4}, {1, 2, 1, 1, 1}, {10, 2, 2}, {4, 1}, {2, 2, 8}, {1, 4, 1, 1, 1, 1, 1, 1}, {2, 2, 1, 3, 1, 1, 1, 1}, {1, 4, 1, 1}, {1, 2, 4, 1, 3}, {2, 2, 2, 1, 1, 1}, {1, 2, 1, 1}, {2, 2, 3}, {4, 5}};

const vector<vector<int>> Hints_Col_quatro1 = {
    {2, 4}, {4, 1, 1, 2, 2}, {2, 1, 1, 1, 1}, {4, 11}, {2, 4, 2, 6, 1}, {7, 2, 1, 1, 1}, {4, 6, 2}, {2, 1, 1, 1, 1}, {4, 1, 1, 2, 2}, {2, 4}, {4, 2, 1}, {5, 1, 1, 2}, {8, 1, 3, 1}, {9, 1, 1}, {2, 1, 2}, {2, 10}, {9, 1, 2}, {8, 1, 3, 1, 1}, {5, 1, 1, 2}, {4, 2, 1}};

const vector<vector<int>> Hints_Line_island = {
    {0}, {0}, {0}, {0}, {1}, {0}, {0}, {0}, {0}, {0}};

const vector<vector<int>> Hints_Col_island = {
    {0}, {0}, {0}, {0}, {0}, {1}, {0}, {0}, {0}, {0}};

// 確定マスを持たない問題（テスト用）
const vector<vector<int>> Hints_Line_SPLAY = {
    {3}, {2}, {4}, {4}, {2, 2}, {1, 1}, {2, 2}, {1, 2}, {1, 2}, {1, 1}};
const vector<vector<int>> Hints_Col_SPLAY = {
    {2}, {2}, {3}, {1, 3}, {4}, {4}, {3}, {3}, {3}, {3}};

const vector<vector<int>> Hints_Line_gun = {
    {0}, {1, 1}, {10}, {9}, {2, 1}, {4}, {2}, {2}, {3}, {0}};
const vector<vector<int>> Hints_Col_gun = {
    {1}, {3}, {7}, {7}, {2, 1, 1}, {4}, {2}, {2}, {3}, {2}};

const vector<vector<int>> Hints_Line_PANDA = {
    {3}, {1, 1}, {3}, {2, 1}, {4, 1}, {10}, {1}, {1}, {1, 2, 2}, {1, 3, 2}};
const vector<vector<int>> Hints_Col_PANDA = {
    {2, 3}, {4}, {3, 1}, {2, 2}, {1, 2}, {1}, {4, 1}, {1, 1, 1}, {3, 1, 2}, {2, 2}};

#endif